factor: procedure options(main);
    dcl answer fixed;
    answer = factorial(6);
    put skip list(answer);
    factorial:
        procedure(n) returns(fixed) recursive;
        dcl n fixed;
        if n = 0 then return(1);
        return(n * factorial(n - 1));
    end factorial;
end factor;
